codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl028.h
extern volatile __AD1CHSbits_t AD1CHSbits __asm__ ("AD1CHS") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CHSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CHSSET __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CHSINV __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CSS __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CSS0:1;
    unsigned CSS1:1;
    unsigned CSS2:1;
    unsigned CSS3:1;
    unsigned CSS4:1;
    unsigned CSS5:1;
    unsigned CSS6:1;
    unsigned CSS7:1;
    unsigned CSS8:1;
    unsigned CSS9:1;
    unsigned CSS10:1;
    unsigned CSS11:1;
    unsigned CSS12:1;
    unsigned CSS13:1;
    unsigned CSS14:1;
    unsigned CSS15:1;
    unsigned CSS16:1;
    unsigned CSS17:1;
    unsigned CSS18:1;
    unsigned CSS19:1;
    unsigned CSS20:1;
    unsigned CSS21:1;
    unsigned CSS22:1;
    unsigned CSS23:1;
    unsigned CSS24:1;
    unsigned CSS25:1;
    unsigned CSS26:1;
    unsigned CSS27:1;
    unsigned CSS28:1;
    unsigned CSS29:1;
    unsigned CSS30:1;
    unsigned CSS31:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CSSbits_t;
extern volatile __AD1CSSbits_t AD1CSSbits __asm__ ("AD1CSS") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CSSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CSSSET __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CSSINV __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CM:2;
    unsigned WM:2;
    unsigned :4;
    unsigned ASINT:2;
    unsigned :2;
    unsigned BGREQ:1;
    unsigned CTMUREQ:1;
    unsigned LPEN:1;
    unsigned ASEN:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CON5bits_t;
extern volatile __AD1CON5bits_t AD1CON5bits __asm__ ("AD1CON5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON5SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON5INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD1HIT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CHH0:1;
    unsigned CHH1:1;
    unsigned CHH2:1;
    unsigned CHH3:1;
    unsigned CHH4:1;
    unsigned CHH5:1;
    unsigned CHH6:1;
    unsigned CHH7:1;
    unsigned CHH8:1;
    unsigned CHH9:1;
    unsigned CHH10:1;
    unsigned CHH11:1;
    unsigned CHH12:1;
    unsigned CHH13:1;
    unsigned CHH14:1;
    unsigned CHH15:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1HITbits_t;
extern volatile __AD1HITbits_t AD1HITbits __asm__ ("AD1HIT") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1HITCLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD1HITSET __attribute__((section("sfrs")));
extern volatile unsigned int        AD1HITINV __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTAT __attribute__((section("sfrs")));
typedef struct {
  unsigned C1OUT:1;
  unsigned C2OUT:1;
  unsigned :6;
  unsigned CVREFSEL:1;
  unsigned :4;
  unsigned SIDL:1;
  unsigned :2;
  unsigned C1EVT:1;
  unsigned C2EVT:1;
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CON __attribute__((section("sfrs")));
typedef struct {
  unsigned CCH:2;
  unsigned :2;
  unsigned CREF:1;
  unsigned :1;
  unsigned EVPOL:2;
  unsigned COUT:1;
  unsigned CEVT:1;
  unsigned :3;
  unsigned CPOL:1;
  unsigned COE:1;
  unsigned ON:1;
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CON __attribute__((section("sfrs")));
typedef struct {
  unsigned CCH:2;
  unsigned :2;
  unsigned CREF:1;
  unsigned :1;
  unsigned EVPOL:2;
  unsigned COUT:1;
  unsigned CEVT:1;
  unsigned :3;
  unsigned CPOL:1;
  unsigned COE:1;
  unsigned ON:1;
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        VR1CON __attribute__((section("sfrs")));
typedef struct {
  unsigned REFSEL:2;
  unsigned :6;
  unsigned VROE:1;
  unsigned :6;
  unsigned ON:1;
  unsigned VRDAT:16;
} __VR1CONbits_t;
extern volatile __VR1CONbits_t VR1CONbits __asm__ ("VR1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        VR1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        VR1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        VR1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CRCCON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned MOD:1;
    unsigned LENDIAN:1;
    unsigned CRCGO:1;
    unsigned CRCISEL:1;
    unsigned CRCMPT:1;
    unsigned CRCFUL:1;
    unsigned VWORD:5;
    unsigned SIDL:1;
    unsigned FRZ:1;
    unsigned ON:1;
    unsigned PLEN:5;
    unsigned :3;
    unsigned DWIDTH:5;
  };
  struct {
    unsigned w:32;
  };
} __CRCCONbits_t;
extern volatile __CRCCONbits_t CRCCONbits __asm__ ("CRCCON") __attribute__((section("sfrs")));
extern volatile unsigned int        CRCCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CRCCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CRCCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CRCXOR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned X1:1;
    unsigned X2:1;
    unsigned X3:1;
    unsigned X4:1;
    unsigned X5:1;
    unsigned X6:1;
    unsigned X7:1;
    unsigned X8:1;
    unsigned X9:1;
    unsigned X10:1;
    unsigned X11:1;
    unsigned X12:1;
    unsigned X13:1;
    unsigned X14:1;
    unsigned X15:1;
    unsigned X16:1;
    unsigned X17:1;
    unsigned X18:1;
    unsigned X19:1;
    unsigned X20:1;
    unsigned X21:1;
    unsigned X22:1;
    unsigned X23:1;
    unsigned X24:1;
    unsigned X25:1;
    unsigned X26:1;
    unsigned X27:1;
    unsigned X28:1;
    unsigned X29:1;
    unsigned X30:1;
    unsigned X31:1;
  };
  struct {
    unsigned w:32;
  };
} __CRCXORbits_t;
extern volatile __CRCXORbits_t CRCXORbits __asm__ ("CRCXOR") __attribute__((section("sfrs")));
extern volatile unsigned int        CRCXORCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CRCXORSET __attribute__((section("sfrs")));
extern volatile unsigned int        CRCXORINV __attribute__((section("sfrs")));
extern volatile unsigned int        CRCDAT __attribute__((section("sfrs")));
typedef struct {
  unsigned CRCDAT:32;
} __CRCDATbits_t;
extern volatile __CRCDATbits_t CRCDATbits __asm__ ("CRCDAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CRCDATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CRCDATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CRCDATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CRCWDAT __attribute__((section("sfrs")));
typedef struct {
  unsigned CRCWDAT:32;
} __CRCWDATbits_t;
extern volatile __CRCWDATbits_t CRCWDATbits __asm__ ("CRCWDAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CRCWDATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CRCWDATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CRCWDATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MODE:3;
    unsigned :2;
    unsigned LCPOL:1;
    unsigned LCOUT:1;
    unsigned LCOE:1;
    unsigned :2;
    unsigned INTN:1;
    unsigned INTP:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned FRZ:1;
    unsigned ON:1;
    unsigned G1POL:1;
    unsigned G2POL:1;
    unsigned G3POL:1;
    unsigned G4POL:1;
  };
  struct {
    unsigned w:32;
  };
} __CLC1CONbits_t;
extern volatile __CLC1CONbits_t CLC1CONbits __asm__ ("CLC1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1SEL __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DS1:3;
    unsigned :1;
    unsigned DS2:3;
    unsigned :1;
    unsigned DS3:3;
    unsigned :1;
    unsigned DS4:3;
  };
  struct {
    unsigned w:32;
  };
} __CLC1SELbits_t;
extern volatile __CLC1SELbits_t CLC1SELbits __asm__ ("CLC1SEL") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1SELCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1SELSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1SELINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1GLS __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned G1D1N:1;
    unsigned G1D1T:1;
    unsigned G1D2N:1;
    unsigned G1D2T:1;
    unsigned G1D3N:1;
    unsigned G1D3T:1;
    unsigned G1D4N:1;
    unsigned G1D4T:1;
    unsigned G2D1N:1;
    unsigned G2D1T:1;
    unsigned G2D2N:1;
    unsigned G2D2T:1;
    unsigned G2D3N:1;
    unsigned G2D3T:1;
    unsigned G2D4N:1;
    unsigned G2D4T:1;
    unsigned G3D1N:1;
    unsigned G3D1T:1;
    unsigned G3D2N:1;
    unsigned G3D2T:1;
    unsigned G3D3N:1;
    unsigned G3D3T:1;
    unsigned G3D4N:1;
    unsigned G3D4T:1;
    unsigned G4D1N:1;
    unsigned G4D1T:1;
    unsigned G4D2N:1;
    unsigned G4D2T:1;
    unsigned G4D3N:1;
    unsigned G4D3T:1;
    unsigned G4D4N:1;
    unsigned G4D4T:1;
  };
  struct {
    unsigned w:32;
  };
} __CLC1GLSbits_t;
extern volatile __CLC1GLSbits_t CLC1GLSbits __asm__ ("CLC1GLS") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1GLSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1GLSSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC1GLSINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MODE:3;
    unsigned :2;
    unsigned LCPOL:1;
    unsigned LCOUT:1;
    unsigned LCOE:1;
    unsigned :2;
    unsigned INTN:1;
    unsigned INTP:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned FRZ:1;
    unsigned ON:1;
    unsigned G1POL:1;
    unsigned G2POL:1;
    unsigned G3POL:1;
    unsigned G4POL:1;
  };
  struct {
    unsigned w:32;
  };
} __CLC2CONbits_t;
