codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl028.h
extern volatile __RPCONbits_t RPCONbits __asm__ ("RPCON") __attribute__((section("sfrs")));
extern volatile unsigned int        RPCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        RPCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR1 __attribute__((section("sfrs")));
typedef struct {
  unsigned INT4R:5;
} __RPINR1bits_t;
extern volatile __RPINR1bits_t RPINR1bits __asm__ ("RPINR1") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR1SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR1INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR2 __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned ICM1R:5;
  unsigned :3;
  unsigned ICM2R:5;
} __RPINR2bits_t;
extern volatile __RPINR2bits_t RPINR2bits __asm__ ("RPINR2") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR2SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR2INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR3 __attribute__((section("sfrs")));
typedef struct {
  unsigned ICM3R:5;
} __RPINR3bits_t;
extern volatile __RPINR3bits_t RPINR3bits __asm__ ("RPINR3") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR3SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR3INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR5 __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned OCFAR:5;
  unsigned :3;
  unsigned OCFBR:5;
} __RPINR5bits_t;
extern volatile __RPINR5bits_t RPINR5bits __asm__ ("RPINR5") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR5SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR5INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR6 __attribute__((section("sfrs")));
typedef struct {
  unsigned TCKIAR:5;
  unsigned :3;
  unsigned TCKIBR:5;
} __RPINR6bits_t;
extern volatile __RPINR6bits_t RPINR6bits __asm__ ("RPINR6") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR6SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR6INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR9 __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned U2RXR:5;
  unsigned :3;
  unsigned U2CTSR:5;
} __RPINR9bits_t;
extern volatile __RPINR9bits_t RPINR9bits __asm__ ("RPINR9") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR9SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR9INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR11 __attribute__((section("sfrs")));
typedef struct {
  unsigned SDI2R:5;
  unsigned :3;
  unsigned SCK2INR:5;
  unsigned :3;
  unsigned SS2INR:5;
} __RPINR11bits_t;
extern volatile __RPINR11bits_t RPINR11bits __asm__ ("RPINR11") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR11SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR11INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR12 __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned CLCINAR:5;
  unsigned :3;
  unsigned CLCINBR:5;
} __RPINR12bits_t;
extern volatile __RPINR12bits_t RPINR12bits __asm__ ("RPINR12") __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR12SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPINR12INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR0 __attribute__((section("sfrs")));
typedef struct {
  unsigned RP1R:4;
  unsigned :4;
  unsigned RP2R:4;
  unsigned :4;
  unsigned RP3R:4;
  unsigned :4;
  unsigned RP4R:4;
} __RPOR0bits_t;
extern volatile __RPOR0bits_t RPOR0bits __asm__ ("RPOR0") __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR0SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR0INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR1 __attribute__((section("sfrs")));
typedef struct {
  unsigned RP5R:4;
  unsigned :4;
  unsigned RP6R:4;
  unsigned :4;
  unsigned RP7R:4;
  unsigned :4;
  unsigned RP8R:4;
} __RPOR1bits_t;
extern volatile __RPOR1bits_t RPOR1bits __asm__ ("RPOR1") __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR1SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR1INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR2 __attribute__((section("sfrs")));
typedef struct {
  unsigned RP9R:4;
  unsigned :4;
  unsigned RP10R:4;
  unsigned :4;
  unsigned RP11R:4;
  unsigned :4;
  unsigned RP12R:4;
} __RPOR2bits_t;
extern volatile __RPOR2bits_t RPOR2bits __asm__ ("RPOR2") __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR2SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR2INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR3 __attribute__((section("sfrs")));
typedef struct {
  unsigned RP13R:4;
  unsigned :4;
  unsigned RP14R:4;
  unsigned :4;
  unsigned RP15R:4;
  unsigned :4;
  unsigned RP16R:4;
} __RPOR3bits_t;
extern volatile __RPOR3bits_t RPOR3bits __asm__ ("RPOR3") __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR3SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR3INV __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR4 __attribute__((section("sfrs")));
typedef struct {
  unsigned RP17R:4;
  unsigned :4;
  unsigned RP18R:4;
  unsigned :4;
  unsigned RP19R:4;
  unsigned :4;
  unsigned RP20R:4;
} __RPOR4bits_t;
extern volatile __RPOR4bits_t RPOR4bits __asm__ ("RPOR4") __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR4SET __attribute__((section("sfrs")));
extern volatile unsigned int        RPOR4INV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSA0:1;
    unsigned ANSA1:1;
    unsigned ANSA2:1;
    unsigned ANSA3:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELACLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELASET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELAINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISA0:1;
    unsigned TRISA1:1;
    unsigned TRISA2:1;
    unsigned TRISA3:1;
    unsigned TRISA4:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISACLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISASET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISAINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTACLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTASET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTAINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATA0:1;
    unsigned LATA1:1;
    unsigned LATA2:1;
    unsigned LATA3:1;
    unsigned LATA4:1;
  };
  struct {
    unsigned w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs")));
extern volatile unsigned int        LATACLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATASET __attribute__((section("sfrs")));
extern volatile unsigned int        LATAINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCA0:1;
    unsigned ODCA1:1;
    unsigned ODCA2:1;
    unsigned ODCA3:1;
    unsigned ODCA4:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCACLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCASET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCAINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUA0:1;
    unsigned CNPUA1:1;
    unsigned CNPUA2:1;
    unsigned CNPUA3:1;
    unsigned CNPUA4:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUAbits_t;
